--文字顯示模式下 字串等不對齊

select * from student;

select id,   rtrim(name)+replicate('_' , (3 - LEN(name))*2  ), 
             CAST(bdate as varchar(20)) ,  LEN(name)
from student


/*
id   
----------- -------- -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- -------------------- -----------
1           陳廷__    1983-04-21           2
2           朱凱鴻     1983-09-23           3
3           蒲怡仁     1983-08-25           3
4           丁肇毅     1983-07-27           3   
*/

select s.id, s.name, c.name, c.score
from  student s JOIN course c
ON  s.id = c.id
order by s.id

/*
id          name                 name                 score
12345678901 12345678901234567890 12345678901234567890 12345678901
----------- -------------------- -------------------- -----------
1           陳廷                   JAVA                 85
1           陳廷                   電概                   81
1           陳廷                   T-SQL                85
1           陳廷                   C#                   85
2           朱凱鴻                  T-SQL                85
2           朱凱鴻                  電概                   80
2           朱凱鴻                  JAVA                 86
*/